---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.GetColor
source: html/bc7c981c-ff66-7ff6-06a6-c697b59c907a.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormalColored.GetColor Method

Gets the vertex's color.

## Syntax (C#)
```csharp
public ColorWithTransparency GetColor()
```

## Returns
The vertex's color.